#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.terraform_remote_state.init: Refreshing state...
module.rytswd.data.aws_iam_policy_document.user: Refreshing state... [id=3396393520]
module.some_member.data.aws_iam_policy_document.user: Refreshing state...
module.member_assumable_role.data.aws_iam_policy_document.assume_role_with_mfa: Refreshing state...
module.admin_assumable_role.data.aws_iam_policy_document.assume_role: Refreshing state...
module.admin_assumable_role.data.aws_iam_policy_document.assume_role_with_mfa: Refreshing state...
module.member_assumable_role.data.aws_iam_policy_document.assume_role: Refreshing state...
aws_iam_account_password_policy.default: Refreshing state... [id=iam-account-password-policy]
module.rytswd.module.aws_user.aws_iam_user.this[0]: Refreshing state... [id=rytswd]
module.rytswd.module.aws_user.aws_iam_access_key.this[0]: Refreshing state... [id=AKIA5J4BMWMQAIQL4NRA]
module.rytswd.module.aws_user.aws_iam_user_login_profile.this[0]: Refreshing state... [id=rytswd]
module.rytswd.aws_iam_user_policy.user: Refreshing state... [id=rytswd:AssumeRoleFor_rytswd]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.admin_assumable_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "admin"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.admin_assumable_role.aws_iam_role_policy_attachment.admin[0] will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "admin"
    }

  # module.member_assumable_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Member"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.member_assumable_role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonCognitoReadOnly"
      + role       = "Member"
    }

  # module.some_member.aws_iam_user_policy.user will be created
  + resource "aws_iam_user_policy" "user" {
      + id     = (known after apply)
      + name   = "AssumeRoleFor_some_member"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::953930786689:role/Member",
                          + "arn:aws:iam::914562528032:role/Member",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "some_member"
    }

  # module.some_member.module.aws_user.aws_iam_access_key.this[0] will be created
  + resource "aws_iam_access_key" "this" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + pgp_key              = "keybase:rytswd"
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "some_member"
    }

  # module.some_member.module.aws_user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "some_member"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.some_member.module.aws_user.aws_iam_user_login_profile.this[0] will be created
  + resource "aws_iam_user_login_profile" "this" {
      + encrypted_password      = (known after apply)
      + id                      = (known after apply)
      + key_fingerprint         = (known after apply)
      + password_length         = 20
      + password_reset_required = true
      + pgp_key                 = "keybase:rytswd"
      + user                    = "some_member"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + some_mmeber_keybase_decrypt = (known after apply)

------------------------------------------------------------------------

This plan was saved to: t.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "t.tfplan"

```

</details>

*Pusher: @rytswd, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform for IAM Setup`*